/* 1.	Напишите объявление статической переменной – члена */

#include <iostream>
using namespace std;

// объявление класса, содержащее статический член данных
class CPi
{
public:
	static double Pi; // статический член данных – константа
};

// объявление статической переменной за пределами класса с одновременной инициализацией
static double Exp = 2.7182818284; // экспонента

// инициализация статического члена класса CPi
double CPi::Pi = 3.141592653589793;

// неинициализированные статические переменные, значение которых = 0 (по умолчанию)
static double ZeroD;
static int ZeroI;
static char ZeroC;

int* pZ; // внешний указатель на int

int _tmain()
{
	double d;
	CPi obj; // объект класса
	double* pPi; // указатель на double
	double* pExp; // указатель на double

	// указатель указывает на статический член данных объекта obj класса CPi
	pPi = &obj.Pi;
	pExp = &::Exp; // указывает на статический член данных Exp – другой вид доступа через ::

	// проверка
	d = obj.Pi; // d = 3.14159
	d = Exp; // d = 2.71828
	d = ::Exp; // d = 2.71828 - так тоже можна
	d = *pPi; // d = 3.14159

	// внешний указатель на int
	pZ = &ZeroI;
	d = *pZ; // d = 0

	*pZ = 5;
	d = ZeroI; // d = 5

	return 0;
}