/*3.	Напишите программу, выполняющую различные вычисления и  выводящую  значений с применение методов форматирования, манипуляторов и флагов объекта cout*/


 
#include <iostream>
#include <iomanip> // для setw()
using namespace std;

int main()
{
	cout.fill('*');
	cout << -12345 << '\n'; // выводим значение без использования ширины поля
	cout << setw(10) << -12345 << '\n'; // выводим значение с использованием ширины поля
	cout << setw(10) << left << -12345 << '\n'; // выравниваем по левому краю
	cout << setw(10) << right << -12345 << '\n'; // выравниваем по правому краю
	cout << setw(10) << internal << -12345 << '\n'; // знак значения выравнивается по левому краю, а само значение - по правому
}

/*
Манипулятор: 
   setw(int) — задаем ширину поля
Флаги группы форматирования adjustfield:
   internal — знак значения выравнивается по левому краю, а само значение — по правому краю;
   left — значение и его знак выравниваются по левому краю;
   right — значение и его знак выравниваются по правому краю
Методы:
   fill(char) — задаем новый символ-заполнитель;
*/